#############################################################
#		테마 정보
#############################################################
#
# [Theme-([Index])]
#
# PreviewImgIdx 는 대기방 가운데에 이미지 Map/Room/Terrain/Preview.smf <- 수정 대상


[Theme-0]
Id=0
Name=포레스트
PreviewImgIdx=0
BgmFileName=Forest00
BgmTitle=리디아 숲속의 축제
BgmAuthor=Danbi


[Theme-1]
Id=1
Name=메가트론
PreviewImgIdx=1
BgmTitle=메가트론의 비밀
BgmAuthor=KmBox
BgmFileName=Megatron00


[Theme-2]
Id=2
Name=에스페란
PreviewImgIdx=2					# <- 이거 어떻게좀 바꿔야함
BgmTitle=에스페란의 위험
BgmAuthor=Danbi
BgmFileName=Esperan00


[Theme-3]
Id=3
Name=아이스리아
PreviewImgIdx=3
BgmTitle=얼음의 성 아이스리아
BgmAuthor=Danbi
BgmFileName=Iceria00


[Theme-4]
Id=4
Name=도미르
PreviewImgIdx=4
BgmAuthor=Danbi
BgmTitle=눈부신 도미르섬
BgmFileName=Domir00

[Theme-5]
Id=5
Name=카멜리아
PreviewImgIdx=5
BgmAuthor=Danbi
BgmTitle=카멜리안 나이트
BgmFileName=Camel00


[Theme-6]
Id=6
Name=불프로그
PreviewImgIdx=6
BgmAuthor=Danbi
BgmTitle=BullFrog
BgmFileName=(NONE)
## Main BGM은 스크립트에서 변경


[Theme-7]
Id=7
Name=드라카
PreviewImgIdx=7
BgmAuthor=Danbi
BgmTitle=Drako
BgmFileName=(NONE)
## Main BGM은 스크립트에서 변경

[Theme-8]
Id=8
Name=비밀의 섬
PreviewImgIdx=9
BgmAuthor=Danbi
BgmTitle=Island
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-9]
Id=9
Name=로즈가든
PreviewImgIdx=8
BgmAuthor=Danbi
BgmTitle=왕녀의 외출
BgmFileName=Garden00

[Theme-10]
Id=10
Name=자미로건쉽
PreviewImgIdx=10
BgmAuthor=Danbi
BgmTitle=Island
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-11]
Id=11
Name=다크나이트
PreviewImgIdx=12
BgmAuthor=Danbi
BgmTitle=UnderWorld
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-12]
Id=12
Name=카멜 지하유적
PreviewImgIdx=13
BgmAuthor=Danbi
BgmTitle=UnderWorld
BgmFileName=Quest05-Stage

[Theme-13]
Id=13
Name=스페셜
PreviewImgIdx=14
BgmAuthor=Danbi
BgmTitle=
BgmFileName=

[Theme-14]
Id=14
Name=브레그마
PreviewImgIdx=15
BgmAuthor=Danbi
BgmTitle=브레그마
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-15]
Id=15
Name=망자의 사막
PreviewImgIdx=16
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=BGM-Game-Desert00
# Main BGM은 스크립트에서 변경

[Theme-16]
Id=16
Name=자미로 비밀기지
PreviewImgIdx=17
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=BGM-Game-Desert00
# Main BGM은 스크립트에서 변경

[Theme-17]
Id=17
Name=하늘
PreviewImgIdx=12
BgmAuthor=Danbi
BgmTitle=하늘
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-18]
Id=18
Name=페스티발
PreviewImgIdx=18
BgmAuthor=Danbi
BgmTitle=페스티발
BgmFileName=Festival

#############################################################
#		맵 정보
#############################################################
#
# [ThemeIndex-MapIndex]
#
#   프로퍼티          :    설명                             (디폴트값)
#	MinUser         : 방의 최소 유저수                       (1)
#	MaxUser         : 방의 최대 유저수                       (2)
#	MinLevel        : 맵을 플레이할 수 있는 최소레벨         (1)
#	MapDisplayName  : 맵의 이름                              ()
#	MapFileName     : 맵 파일이름                            ()
#	AvailableMode   : 맵을 플레이할 수 있는 모드             ([Pvp],[Hunting])
#	RequestedClearQuestId
#	CursorColor     : 커서 색깔                              (FFFFFFFF)
#	RequiredQuestClear : 퀘스트 클리어 조건(퀘스트Id)		 (0)    		 1:개굴 2:용 3:섬 4:비행기 5:말 6:해
#	OpenLocale : 1 - 한국, 2 - 일본,  4 - 중국  .... 가능한 국가들에 대한 값을 모두 더 함.
#	

#  (퀘스트)
#   QuestId         : 퀘스트 Id


####################
# 포레스트 테마

[0-0]
MapFileName=Forest_b
MapDisplayName=포레스트 입구
CursorColor=FFFFFFFF
MaxUser=4
OpenLocale=7

[0-1]
MapFileName=Forest00
MapDisplayName=포레스트 오크나무
CursorColor=FFFFFFFF
MinLevel=4
OpenLocale=7

[0-2]
MapFileName=Forest02
MapDisplayName=포레스트 달팽이 연못
CursorColor=FFFFFFFF
MinLevel=4
OpenLocale=7

[0-3]
MapFileName=Forest_M00
MapDisplayName=포레스트 무투장
CursorColor=FFFFFFFF
AvailableMode=[Mutu]

[0-4]
MapFileName=Forest03
MapDisplayName=포레스트 개미지옥
CursorColor=FFFFFFFF
MinLevel=8
MaxUser=4
FallDownEffectFileName=Effects/Environment/Efx/AntLionDie.efx
OpenLocale=3

####################
# 메가트론 테마

[1-0]
MapFileName=Megatron_b
MapFileNameChn=Megatron_b_ch
MapDisplayName=메가트론 입구
CursorColor=FFFFFFFF
MaxUser=4
OpenLocale=7


[1-1]
MapFileName=Megatron01
MapFileNameChn=Megatron01_ch
MapDisplayName=메가트론 고철처리장
CursorColor=FFFFFFFF
MinLevel=4
OpenLocale=7


[1-2]
MapFileName=Megatron00
MapFileNameChn=Megatron00_ch
MapDisplayName=메가트론 하수처리장
CursorColor=FFFFFFFF
MinLevel=6
OpenLocale=7


[1-3]
MapFileName=Megatron_M00
MapFileNameChn=Megatron_M00_ch
MapDisplayName=메가트론 무투장
CursorColor=FFFFFFFF
AvailableMode=[Mutu]

####################
# 에스페란 테마

[2-0]
MapFileName=Esperan_b
MapDisplayName=에스페란 입구
CursorColor=FFFFFFFF
MaxUser=4
OpenLocale=7

[2-1]
MapFileName=Esperan00
MapDisplayName=에스페란 용암동굴
CursorColor=FFFFFFFF
MinLevel=4
OpenLocale=7
FallDown=1

[2-2]
MapFileName=Esperan03
MapDisplayName=에스페란 돌다리
CursorColor=FFFFFFFF
MinLevel=8
OpenLocale=3
FallDown=1

[2-3]
MapFileName=Esperan_M00
MapDisplayName=에스페란 무투장
CursorColor=FFFFFFFF
AvailableMode=[Mutu]
FallDown=1

[2-4]
MapFileName=Esperan04
MapDisplayName=에스페란 해골성
CursorColor=FFFFFFFF
MinLevel=8
MaxUser=4
OpenLocale=3
FallDown=1

####################
# 아이스리아 테마

[3-0]
MapFileName=Iceria_b
MapDisplayName=아이스리아 입구
CursorColor=FFFF4040
MaxUser=4
OpenLocale=7

[3-1]
MapFileName=Iceria00
MapDisplayName=아이스리아 영웅의 다리
CursorColor=FFFF4040
MinLevel=6
OpenLocale=3

[3-2]
MapFileName=Iceria02
MapDisplayName=아이스리아 북문
CursorColor=FFFF4040
MinLevel=11
OpenLocale=3


[3-3]
MapFileName=Iceria_M00
MapDisplayName=아이스리아 무투장
CursorColor=FFFF4040
AvailableMode=[Mutu]

[3-4]
MapFileName=Iceria03
MapDisplayName=아이스리아 얼음탑
CursorColor=FFFF4040
MinLevel=11오후 2:00 2007-07-03
OpenLocale=3

# 도미르 테마

[4-0]
MapFileName=Domir_Newbie
MapDisplayName=수류탄 훈련장
CursorColor=FFFF4040
MaxUser=2
HeightLimit=400
OpenLocale=7

[4-1]
MapFileName=Domir_b
MapDisplayName=도미르 입구
CursorColor=FFFF4040
MaxUser=4
MinLevel=6
OpenLocale=3

[4-2]
MapFileName=Domir03
MapDisplayName=도미르 캠프장
CursorColor=FFFF4040
MinLevel=11
OpenLocale=3

[4-3]
MapFileName=Domir00
MapDisplayName=도미르 카스카해변
CursorColor=FFFF4040
MinLevel=13
OpenLocale=3

[4-4]
MapFileName=Domir_M00
MapDisplayName=도미르 무투장
CursorColor=FFFF4040
AvailableMode=[Mutu]

####################
# 카멜리아 테마

[5-0]
MapFileName=Camel00
MapDisplayName=카멜궁 1층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=8


[5-1]
MapFileName=Camel01
MapDisplayName=카멜궁 2층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=16


[5-2]
MapFileName=Camel02
MapDisplayName=카멜궁 3층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=21

[5-3]
MapFileName=Camel_M00
MapDisplayName=카멜궁 무투장
CursorColor=FFFFFFFF
MaxUser=6
AvailableMode=[Mutu]

####################
# 로즈가든 테마

[9-0]
MapFileName=Garden00
MapDisplayName=로즈가든 광장
CursorColor=FFFF4040
MaxUser=6
MinLevel=11
OpenLocale=3

[9-1]
MapFileName=Garden01
MapDisplayName=로즈가든 비밀의 화원
CursorColor=FFFF4040
MaxUser=6
MinLevel=16
OpenLocale=3

[9-2]
MapFileName=Garden_M00
MapDisplayName=로즈가든 무투장
CursorColor=FFFF4040
MaxUser=6
AvailableMode=[Mutu]

####################
# 카멜 지하유적 테마

[12-0]
MapFileName=Newbe2-1
MapDisplayName=지하유적 입구
CursorColor=FFFFFF40
MaxUser=2
OpenLocale=7


[12-1]
MapFileName=CamelCulvert00
MapDisplayName=지하유적 지하 1층
CursorColor=FFFF4040
MaxUser=6
MinLevel=8
OpenLocale=3


[12-2]
MapFileName=CamelCulvert01
MapDisplayName=지하유적 지하 2층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=13
OpenLocale=3


[12-3]
MapFileName=CamelCulvert_M00
MapDisplayName=지하유적 무투장
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]


[12-4]
MapFileName=CamelCulvert02
MapDisplayName=지하유적 지하 3층
CursorColor=FFFFFF40
MaxUser=6
Minlevel=15

[12-5]
MapFileName=CamelCulvert03
MapDisplayName=지하유적 비밀의 방
CursorColor=FFFFFF40
MaxUser=2
LockInBreakable=1
OpenLocale=7

[12-6]
MapFileName=CamelCulvert04
MapDisplayName=지하유적 잊혀진 광장
CursorColor=FFFFFF40
MaxUser=4
Minlevel=6
LockInBreakable=1
FallDown=1
FallDownEffectFileName=Effects/Camel/Efx/WasteWaterDamage00.efx
OpenLocale=7

#스페셜 테마
[13-0]
MapFileName=Boss_Bullfrog_M00
MapDisplayName=불프로그
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=BullFrog
BgmFileName=Boss01
RequiredQuestClear=1

[13-1]
MapFileName=Boss_Draka_M00
MapDisplayName=드라카
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=Draka
BgmFileName=Quest02-Esperan
RequiredQuestClear=2

[13-2]
MapFileName=Boss_Island_M00
MapDisplayName=비밀의 섬
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=Island
BgmFileName=Quest03-boss
RequiredQuestClear=3

[13-3]
MapFileName=Boss_Airship_M00
MapDisplayName=자미로건쉽
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=GunShip
BgmFileName=Quest04-boss
RequiredQuestClear=4

[13-4]
MapFileName=Boss_Darknight_M00
MapDisplayName=다크나이트
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=UnderWorld
BgmFileName=Quest05-boss
RequiredQuestClear=5

[13-5]
MapFileName=Boss_Bregma_M00
MapDisplayName=브레그마
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=브레그마
BgmFileName=Quest06-boss
RequiredQuestClear=6

#망자의 사막
[15-0]
MapFileName=Desert01
MapDisplayName=망각의 시간
CursorColor=FFFFFF40
MaxUser=4
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=12

[15-1]
MapFileName=Desert03
MapDisplayName=현자의 돌
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=14

[15-2]
MapFileName=Desert02
MapDisplayName=고요의 땅
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=16

################################
#페스티발 테마(중국)

[18-0]
MapFileName=Festival00
MapDisplayName=축제의 시작
CursorColor=FFFFFF40
MaxUser=4
BgmAuthor=Danbi
BgmTitle=페스티발
BgmFileName=Festival
MinLevel=2
OpenLocale=1

[18-1]
MapFileName=Festival02
MapDisplayName=구름 다리
CursorColor=FFFFFF40
MaxUser=4
BgmAuthor=Danbi
BgmTitle=페스티발
BgmFileName=Festival
FallDown=1
FallDownEffectFileName=Maps/Festival/Effect/FestivalWaterDamage00.efx
MinLevel=4
OpenLocale=1

[18-2]
MapFileName=Festival01
MapDisplayName=한밤의 축제
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=페스티발
BgmFileName=Festival
MinLevel=6
OpenLocale=1


###############################################################################
#
#
#	NewPvP용 맵이다!! [ThemeIdx-100 + x]
#   NewPvp 맵인덱스는 100번대
#



# 포레스트 테마

[0-100]
MapFileName=Forest_b:NewPvp
MapDisplayName=포레스트 입구
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=7

[0-101]
MapFileName=Forest00:NewPvp
MapDisplayName=포레스트 오크나무
CursorColor=FFFFFFFF
MinLevel=4
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=7

[0-102]
MapFileName=Forest02:NewPvp
MapDisplayName=포레스트 달팽이 연못
CursorColor=FFFFFFFF
MinLevel=4
AvailableMode=[NewPvp]
#ZoomRatio=1.2
OpenLocale=7

[0-103]
MapFileName=Forest03:NewPvp
MapDisplayName=포레스트 개미지옥
CursorColor=FFFFFFFF
MinLevel=8
AvailableMode=[NewPvp]
#ZoomRatio=1.2
FallDown=1
FallDownEffectFileName=Effects/Environment/Efx/AntLionDie.efx
MaxUser=4
OpenLocale=3


# 메가트론 테마

[1-100]
MapFileName=Megatron_b:NewPvp
MapFileNameChn=Megatron_b_ch:NewPvp
MapDisplayName=메가트론 입구
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=7


[1-101]
MapFileName=Megatron01:NewPvp
MapFileNameChn=Megatron01_ch:NewPvp
MapDisplayName=메가트론 고철처리장
CursorColor=FFFFFFFF
MinLevel=4
AvailableMode=[NewPvp]
#ZoomRatio=1.2
OpenLocale=7


[1-102]
MapFileName=Megatron00:NewPvp
MapFileNameChn=Megatron00_ch:NewPvp
MapDisplayName=메가트론 하수처리장
CursorColor=FFFFFFFF
MinLevel=6
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=7




# 에스페란 테마

[2-100]
MapFileName=Esperan_b:NewPvp
MapDisplayName=에스페란 입구
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=7


[2-101]
MapFileName=Esperan00:NewPvp
MapDisplayName=에스페란 용암동굴
CursorColor=FFFFFFFF
MinLevel=4
AvailableMode=[NewPvp]
#ZoomRatio=1.1
OpenLocale=7
FallDown=1


[2-102]
MapFileName=Esperan03:NewPvp
MapDisplayName=에스페란 돌다리
CursorColor=FFFFFFFF
MinLevel=8
AvailableMode=[NewPvp]
#ZoomRatio=1.1
OpenLocale=3
FallDown=1


[2-103]
MapFileName=Esperan04:NewPvp
MapDisplayName=에스페란 해골성
CursorColor=FFFFFFFF
MinLevel=8
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.1
OpenLocale=3
FallDown=1


# 아이스리아 테마

[3-100]
MapFileName=Iceria_b:NewPvp
MapDisplayName=아이스리아 입구
CursorColor=FFFF4040
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=7


[3-101]
MapFileName=Iceria00:NewPvp
MapDisplayName=아이스리아 영웅의 다리
CursorColor=FFFF4040
MinLevel=6
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3


[3-102]
MapFileName=Iceria02:NewPvp
MapDisplayName=아이스리아 북문
CursorColor=FFFF4040
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3

[3-103]
MapFileName=Iceria03:NewPvp
MapDisplayName=아이스리아 얼음탑
CursorColor=FFFF4040
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
#OpenLocale=3
OpenLocale=3


# 도미르 테마

[4-100]
MapFileName=Domir_Newbie:NewPvp
MapDisplayName=수류탄 훈련장
CursorColor=FFFF4040
MaxUser=2
AvailableMode=[NewPvp]
HeightLimit=400
OpenLocale=7


[4-101]
MapFileName=Domir_b:NewPvp
MapDisplayName=도미르 입구
CursorColor=FFFF4040
MaxUser=6
MinLevel=6
AvailableMode=[NewPvp]
#ZoomRatio=1.2
OpenLocale=3


[4-102]
MapFileName=Domir03:NewPvp
MapDisplayName=도미르 캠프장
CursorColor=FFFF4040
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3


[4-103]
MapFileName=Domir00:NewPvp
MapDisplayName=도미르 카스카해변
CursorColor=FFFF4040
MinLevel=13
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3


# 카멜궁 테마

[5-100]
MapFileName=Camel00:NewPvp
MapDisplayName=카멜궁 1층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=8
AvailableMode=[NewPvp]
#ZoomRatio=1.0


[5-101]
MapFileName=Camel01:NewPvp
MapDisplayName=카멜궁 2층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=16
AvailableMode=[NewPvp]
#ZoomRatio=1.0

[5-102]
MapFileName=Camel02:NewPvp
MapDisplayName=카멜궁 3층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=21
AvailableMode=[NewPvp]
#ZoomRatio=1.0



# 로즈가든 테마

[9-100]
MapFileName=Garden00:NewPvp
MapDisplayName=로즈가든 광장
CursorColor=FFFF4040
MaxUser=6
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3

[9-101]
MapFileName=Garden01:NewPvp
MapDisplayName=로즈가든 비밀의 화원
CursorColor=FFFF4040
MaxUser=6
MinLevel=16
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3




# 카멜 지하유적 테마

[12-100]
MapFileName=Newbe2-1:NewPvp
MapDisplayName=지하유적 입구
CursorColor=FFFFFF40
MaxUser=2
AvailableMode=[NewPvp]
OpenLocale=7


[12-101]
MapFileName=CamelCulvert00:NewPvp
MapDisplayName=지하유적 지하 1층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=8
AvailableMode=[NewPvp]
OpenLocale=3

[12-102]
MapFileName=CamelCulvert01:NewPvp
MapDisplayName=지하유적 지하 2층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=13
AvailableMode=[NewPvp]
OpenLocale=3

[12-103]
MapFileName=CamelCulvert02:NewPvp
MapDisplayName=지하유적 지하 3층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=15
AvailableMode=[NewPvp]

[12-104]
MapFileName=CamelCulvert03:NewPvp
MapDisplayName=지하유적 비밀의 방
CursorColor=FFFFFF40
MaxUser=2
LockInBreakable=1
AvailableMode=[NewPvp]
OpenLocale=7

[12-105]
MapFileName=CamelCulvert04:NewPvp
MapDisplayName=지하유적 잊혀진 광장
CursorColor=FFFFFF40
MaxUser=4
Minlevel=6
LockInBreakable=1
FallDown=1
AvailableMode=[NewPvp]
FallDownEffectFileName=Effects/Camel/Efx/WasteWaterDamage00.efx
OpenLocale=7

#망자의 사막
[15-100]
MapFileName=Desert01:NewPvp
MapDisplayName=망각의 시간
CursorColor=FFFFFF40
MaxUser=4
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=12
AvailableMode=[NewPvp]

[15-101]
MapFileName=Desert03:NewPvp
MapDisplayName=현자의 돌
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=14
AvailableMode=[NewPvp]

[15-102]
MapFileName=Desert02:NewPvp
MapDisplayName=고요의 땅
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=16
AvailableMode=[NewPvp]

#############################################################################

#페스티발
[18-100]
MapFileName=Festival00:NewPvp
MapDisplayName=축제의 시작
CursorColor=FFFFFF40
MaxUser=4
MinLevel=2
AvailableMode=[NewPvp]
OpenLocale=1

[18-101]
MapFileName=Festival02:NewPvp
MapDisplayName=구름 다리
CursorColor=FFFFFF40
MaxUser=4
MinLevel=4
AvailableMode=[NewPvp]
FallDown=1
FallDownEffectFileName=Effects/Camel/Efx/WasteWaterDamage00.efx
OpenLocale=1

[18-102]
MapFileName=Festival01:NewPvp
MapDisplayName=한밤의 축제
CursorColor=FFFFFF40
MaxUser=6
MinLevel=6
AvailableMode=[NewPvp]
OpenLocale=1

###############################################################################
#
#
#	Quest용 맵이다!!
#	[QuestIdx-MapSeqIdx]
#  퀘스트 맵 인덱스는 200번대
#



# 불프로그
[6-200]
MapFileName=Boss00
MapDisplayName=불프로그
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
QuestId=1
HasLevelMap=1				# HasLevelMap이 true이면 난이도에 따라 [MapFileName#Easy.map], [MapFileName#Normal.map] 등을 사용하게된다
#MinLevel=5
Description=정체모를 괴물이 작은 마을들을 습격하고 있다!\n타이 일행에게 들어온 구조 요청. 과연 괴물의 정체는?
OpenLocale=7

# 드라카
[7-200]
MapFileName=Quest02_1
MapDisplayName=드라카
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
BgmFileName=Quest02-Esperan
QuestId=2
ShareView=1
NextMapFileName=Quest02_2
HasLevelMap=1				# HasLevelMap이 true이면 난이도에 따라 [MapFileName#Easy.map], [MapFileName#Normal.map] 등을 사용하게된다
#MinLevel=3
Description=에스페란 유적에서 연이어 발생하는 괴물의 습격.\n괴물의 정체에 대한 목격자들의 주장이 엇갈리는\n가운데 타이 일행이 조사에 나선다.
FallDownEffectFileName=Environment/Efx/CharacterFire00.efx
OpenLocale=7
FallDown=1

[7-201]
MapFileName=Quest02_2
MapDisplayName=드라카
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
QuestId=2
#ShareView=1
OpenLocale=7
FallDownEffectFileName=Environment/Efx/CharacterFire00.efx
HasLevelMap=1

[8-200]
MapFileName=Quest03_1
MapDisplayName=비밀의 섬
CursorColor=FFFF4040
MaxUser=4
AvailableMode=[Quest]
QuestId=3
ShareView=1
NextMapFileName=Quest03_6
HasLevelMap=1				# HasLevelMap이 true이면 난이도에 따라 [MapFileName#Easy.map], [MapFileName#Normal.map] 등을 사용하게된다
Description=익시드호로 여행중이던 일행 앞에 나타난 의문의 섬.\n레이더에도, 지도에도 나타나지 않은 이 섬에서 과연 일행을 기다리고 있는 것은?
OpenLocale=7

#[8-1]
#MapFileName=Quest03_2
#MapDisplayName=비밀의 섬 떨어지기
#CursorColor=FFFF4040
#MaxUser=4
#AvailableMode=[Quest]
#QuestId=3
#ShareView=1
#NextMapFileName=Quest03_3

#[8-2]
#MapFileName=Quest03_3
#MapDisplayName=비밀의 섬 지하
#CursorColor=FFFF4040
#MaxUser=4
#AvailableMode=[Quest]
#QuestId=3
#ShareView=1
#NextMapFileName=Quest03_5
#HasLevelMap=1

#[8-3]
#MapFileName=Quest03_5
#MapDisplayName=비밀의 섬 안쪽
#CursorColor=FFFF4040
#MaxUser=4
#AvailableMode=[Quest]
#QuestId=3
#ShareView=1
#NextMapFileName=Quest03_6
#HasLevelMap=1

[8-201]
MapFileName=Quest03_6
MapDisplayName=비밀의 섬
CursorColor=FFFF4040
MaxUser=4
AvailableMode=[Quest]
QuestId=3
OpenLocale=7

[10-200]		# 건쉽 보스
MapFileName=Quest04
MapDisplayName=자미로건쉽
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
QuestId=4
#MinLevel=7
Description=계속되는 조사를 마치고 도미르 섬으로 돌아가는 타이 일행.\n하지만 자미로의 추격은 계속된다!\n일행은 과연 이 위기에서 벗어날 수 있을것인가!
OpenLocale=7


[11-200]		# 다크나이트
MapFileName=Quest05_stage
MapDisplayName=다크나이트
CursorColor=FFFFFF40
MaxUser=4
AvailableMode=[Quest]
QuestId=5
#MinLevel=7
ShareView=1
HasLevelMap=1				# HasLevelMap이 true이면 난이도에 따라 [MapFileName#Easy.map], [MapFileName#Normal.map] 등을 사용하게된다
NextMapFileName=Quest05_boss
Description=천년 고도 카멜의 지하에서 발견된 고대 유적.\n어두운 지하 던전 속에서 미지의 유적을 탐험하고 있는\n 타이 일행의 앞에 나타난 적의 정체는...?
OpenLocale=3

[11-201]
MapFileName=Quest05_boss
MapDisplayName=다크나이트
CursorColor=FFFFFF40
MaxUser=4
AvailableMode=[Quest]
QuestId=5
OpenLocale=3

[14-200]		# Quest 6 브레그마
MapFileName=Quest06_stage
MapFileNameChn=Quest06_stage_ch
MapDisplayName=브레그마
CursorColor=FFFFFF40
MaxUser=4
AvailableMode=[Quest]
QuestId=6
#MinLevel=7
ShareView=1
HasLevelMap=1				# HasLevelMap이 true이면 난이도에 따라 [MapFileName#Easy.map], [MapFileName#Normal.map] 등을 사용하게된다
NextMapFileName=Quest06_boss
Description=Quest6
FallDownEffectFileName=Effects/Quest06/Efx/LightingAreaDeath.efx
OpenLocale=3
FallDown=1

[14-201]
MapFileName=Quest06_boss
MapDisplayName=브레그마
CursorColor=FFFFFF40
MaxUser=4
AvailableMode=[Quest]
QuestId=6
OpenLocale=3

[16-100]
MapFileName=Quest07_Intro
MapDisplayName=자미로 비밀 연구소
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
NextMapFileName=Quest07_1
QuestId=7
OpenLocale=3

[16-101]
MapFileName=Quest07_1
MapDisplayName=자미로 비밀 연구소
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
NextMapFileName=Quest07_2
QuestId=7
OpenLocale=3

[16-102]
MapFileName=Quest07_2
MapDisplayName=자미로 비밀 연구소
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
NextMapFileName=Quest07_3
QuestId=7
OpenLocale=3

[16-103]
MapFileName=Quest07_3
MapDisplayName=자미로 비밀 연구소
CursorColor=FFFFFFFF
MaxUser=4
AvailableMode=[Quest]
QuestId=7
OpenLocale=3

[17-1]
MapFileName=Quest08
MapDisplayName=푸른 하늘
CursorColor=FFFFFF00
MaxUser=4
AvailableMode=[Quest]
NextMapFileName=Quest08_1
QuestId=8
OpenLocale=0

[17-1]
MapFileName=Quest08_1
MapDisplayName=푸른 하늘의 보스
CursorColor=FFFFFF00
MaxUser=4
AvailableMode=[Quest]
QuestId=8
OpenLocale=0
